"""
算数运算符
"""

# """
# 算数运算符
# """

# 算数运算符: + - * / % ** //
print("10 + 20 = ", 10 + 20)
print("10 - 20 = ", 10 - 20)
print("10 * 20 = ", 10 * 20)
print("10 / 20 = ", 10 / 20)
print("10 % 20 = ", 10 % 20)
print("10 ** 20 = ", 10**20)
print("10 // 20 = ", 10 // 20)

# 算数运算符的优先级: 先乘除后加减，先括号后乘除，先幂运算后乘除，先加减后移位，先关系运算后逻辑运算，先赋值后逗号
print("0.1 + 10 / 4 ** 2 = ", 0.1 + 10 / 4**2)


# """
# 案例1要求输入两个数x和y,分别输出x+y的结果和x-y的结果
# """

x = int(input("请输出x的值: "))
y = int(input("请输出y的值: "))
print("x+y的结果为: ", x + y)
print("x-y的结果为: ", x - y)


x = float(input("请输出x的值: "))
y = float(input("请输出y的值: "))
print("x+y的结果为: ", x + y)
print(
    "x-y的结果为: ", x - y
)  # x-y的结果为:  0.09999999999999998    精度损失，由于计算机底层是基于二进制进行数据的存储与处理，二进制是无法准确表示所有小数，因此涉及到浮点数的运算，可能会损失精度。


# """
# 案例2:计算输入的三个整数的平均数
# """

a = int(input("请输入第一个数字："))
b = int(input("请输入第二个数字："))
c = int(input("请输入第三个数字："))

avg = (a + b + c) / 3

print(f"{a},{b},{c} 这三个数的平均数为：{avg}")


# """
# 要求输入梯形的上底、下底和高，计算梯形的面积
# """

top = float(input("请输出梯形的上底："))
bottom = float(input("请输入梯形的下底："))
height = float(input("请输入梯形的高："))

area = (top + bottom) * height / 2

print(f"梯形的面试为：{area}")
